import pandas as pd

文章_标题 = "胃癌患者癌组织中赖氨酸去甲基化酶3A的表达及临床意义"
文章_内容 = [['A', 'B'],
             ['流水号:', '2020582746'],
             ['摘要:','目的:探讨赖氨酸去甲基化酶3A(KDM3A)在胃癌组织中的表达及临床意义。方法:回顾性分析武汉市中心医院胃肠外科2012年1月到2014年12月收治的胃癌患者术后组织标本100例,采用免疫组化方法检测胃癌组织中KDM3A表达,并根据免疫组化结果分为KDM3A高、低表达两组,采用Kaplan-Meier曲线法和Log-rank检验比较KDM3A高、低表达组患者无瘤生存率和总生存率的差异,采用Cox比例风险模型分析影响胃癌患者无瘤生存率和总生存率的独立危险因素。结果:KDM3A高表达者比例为58.0%(58/100),KDM3A低表达者比例为42.0%(42/100)。KDM3A的表达与胃癌患者TNM分期(P=0.006)和N分类(P=0.010)显著相关。KDM3A高表达组患者5年无瘤生存率显著低于KDM3A低表达组患者(18.7%vs.28.5%,P=0.009)。KDM3A高表达组患者5年总生存率显著低于KDM3A低表达组患者(21.4%vs.33.2%,P=0.003)。单因素分析结果显示:TNM分期、T分类、N分类和KDM3A表达是影响患者无瘤生存率的危险因素(均P<0.05);多因素分析显示TNM分期(P=0.010)及KDM3A表达(P=0.037)是影响患者无瘤生存率的独立危险因素。单因素分析结果显示:TNM分期、N分类、组织学分化和KDM3A表达是影响患者总生存率的危险因素;多因素分析显示组织学分化(P=0.038)及KDM3A表达(P=0.002)是影响患者总生存率的独立危险因素。结论:KDM3A是影响胃癌患者预后的新的分子标志物。'],
             ['作者:', ''],
             ['作者单位:','(1)华中科技大学同济医学院附属武汉中心医院胃肠外科,武汉 430014; (2)华中科技大学同济医学院附属同济医院胃肠外科,武汉 430030'],
             ['出处:', '华中科技大学学报·医学版\xa0 2020;\xa049(4) :\xa0481-485'],
             ['ISSN:', '1672-0741'], ['国内代码:', '42-1678/R'],
             ['关键词:', 'KDM3A;\xa0 胃癌;\xa0 表达;\xa0 临床意义'],
             ['学科分类号:', 'R341.7;\xa0R392.31;\xa0R730.2;\xa0*R735.2;\xa0R735.202.2;\xa0R977.4'],
             ['主题词[机]:',
              '肿瘤 /*病理学 ;\xa0 存活率 ;\xa0 *胃 ;\xa0 *脱甲基化 ;\xa0 *酶类 ;\xa0 赖氨酸 ;\xa0 危险因素 ;\xa0 肿瘤分期 ;\xa0 因素分析, 统计学 ;\xa0 免疫组织化学 /方法'],
             ['特征词:', '人类'],
             ['基金:', '湖北省自然科学基金资助项目 (No.2019CFC845)'],
             ['原文链接:', '']]
内容 = []
内容.append(文章_标题)
for row in 文章_内容:
    # print(row)
    key = row[0]

    if "流水号" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "摘要" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "作者" in key and "单位" not in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "作者单位" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "出处" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "ISSN" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "关键词" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "学科分类号" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "主题词[机]" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "特征词" in key:
        内容.append(row[1].replace(u'\xa0', ''))
    if "基金" in key:
        内容.append(row[1].replace(u'\xa0', ''))
print(内容)

# df = pd.DataFrame(columns=(
# "标题", "流水号", "摘要", "作者", "作者单位", "出处", "ISSN", "关键词", "学科分类号", "主题词[机]", "特征词", "基金"))
#
# df.loc[1] = 内容
# print(df)
