
门诊细 = "体格检查:T:36℃ P:76次/分 R:18次/分 BP:123/76mmHg神志清，精神不振，双肺呼吸音粗，未闻及干湿性啰音，心率76次/分，律齐，心前区未闻及杂音，腹软，无压痛，双下肢无水肿。"
# 体温
print('体温：'+门诊细[int(int(门诊细.find('T:')))+2:int(门诊细.find('℃'))])
门诊细 = 门诊细[:int(门诊细.find('T:'))] + 门诊细[int(门诊细.find('℃'))+1:]
print(门诊细)

# 血压
print('血压：'+门诊细[int(int(门诊细.find('BP:')))+3:int(门诊细.find('mmHg'))])
门诊细 = 门诊细[:int(门诊细.find('BP:'))] + 门诊细[int(门诊细.find('mmHg'))+4:]
print(门诊细)

# 脉搏
print('脉搏：' + 门诊细[int(int(门诊细.find('P:')))+2:int(门诊细.find('次/分'))])
门诊细 = 门诊细[:int(门诊细.find('P:'))] + 门诊细[int(门诊细.find('次/分'))+3:]
print(门诊细)

# 呼吸
print('呼吸：'+门诊细[int(int(门诊细.find('R:')))+2:int(门诊细.find('次/分'))])
门诊细 = 门诊细[:int(门诊细.find('R:'))] + 门诊细[int(门诊细.find('次/分'))+3:]
print(门诊细)

# 心率
print('心率：'+门诊细[int(int(门诊细.find('心率')))+2:int(门诊细.find('次/分'))])
门诊细 = 门诊细[:int(门诊细.find('心率'))] + 门诊细[int(门诊细.find('次/分'))+3:]
print(门诊细)

