SQL查询结果 = [('756286168', 54215841, '54215841-1', '61584221', 'Y000002996', '美达信（大）', '20mg*14片/盒', '01',
                '口服', 20.0, 'mg', 'QD', '每天1次', '1', '片剂', '盒', 3.57, None, None, 1, 3.0, '1', '0', None, None),
               ('756286168', 54215841, '54215841-2', '61584222', 'Y000003673', '苯磺酸氨氯地平片（京新）', '5mg*28片/盒',
                '01', '口服', 5.0, 'mg', 'QD', '每天1次', '1', '片剂', '盒', 1.68, None, None, 1, 2.0, '1', '0', None,
                None), (
                   '756286168', 54215841, '54215841-3', '61584223', 'Y000000548', '醋酸泼尼松片', '5mg*100粒/瓶', '01',
                   '口服', 5.0, 'mg', 'QD', '每天1次', '1', '片剂', '粒', 6.28, None, None, 1, 100.0, '1', '0', None,
                   None),
               ('756286168', 54392654, '54392654-1', '61783326', 'Y000002987', '瑞夫恩', '0.5mg*21粒/盒', '01', '口服',
                0.5, 'mg', 'QD', '每天1次', '61', '分散片', '盒', 3.5, None, None, 1, 3.0, '1', '0', None, None), (
                   '756286168', 54392654, '54392654-2', '61783327', 'Y000003342', '泮托拉唑钠肠溶片', '40mg*30片/盒',
                   '01',
                   '口服', 40.0, 'mg', 'QD', '每天1次', '1', '片剂', '盒', 19.86, None, None, 1, 1.0, '1', '0', None,
                   None)]


# 计算用药日剂量
def calDailyDosage(frequency, type):
    if frequency == "QD" or frequency == "QN" or frequency == "QM":
        随访缺失数据字典[type + '_剂量'] = row[9]
    elif frequency == "BID" or frequency == "Q12H" or frequency == "BIDAC" or frequency == "BIDCS":
        随访缺失数据字典[type + '_剂量'] = row[9] * 2
    elif frequency == "TID" or frequency == "TIDCS" or frequency == "Q8H":
        随访缺失数据字典[type + '_剂量'] = row[9] * 3
    elif frequency == "QOD":
        随访缺失数据字典[type + '_剂量'] = row[9] / 2
    elif frequency == "Q3D":
        随访缺失数据字典[type + '_剂量'] = row[9] / 3
    elif frequency == "QW":
        随访缺失数据字典[type + '_剂量'] = row[9] / 7
    elif frequency == "BIW2" or frequency == "BIW3":
        随访缺失数据字典[type + '_剂量'] = (row[9] * 2) / 7


随访缺失数据字典 = {}

for row in SQL查询结果:
    # 抗增殖类
    if row[5] in ['骁悉', '赛可平', '米芙', '爱若华', '素能', '硫唑嘌呤片', '瑞易容', '硫唑嘌呤片（依木兰）', '硫唑嘌呤片']:
        # 药品名
        if row[5] == '骁悉' or row[5] == '赛可平' or row[5] == '米芙' or row[5] == '素能' or row[5] == '瑞易容':
            随访缺失数据字典['抗增殖类_药品'] = row[5]
        elif row[5] == '爱若华':
            随访缺失数据字典['抗增殖类_药品'] = '来氟米特'
        elif row[5] == '硫唑嘌呤片（依木兰）' or row[5] == '硫唑嘌呤片':
            随访缺失数据字典['抗增殖类_药品'] = '硫唑嘌呤'
        # 日剂量
        calDailyDosage(row[11], '抗增殖类')

    # 环孢素
    if row[5] in ['新山地明', '新赛斯平', '小新赛斯平']:
        if row[5] == '新山地明':
            随访缺失数据字典['环孢素_药品'] = '新山地明（诺华）'
        elif row[5] == '新赛斯平' or row[5] == '小新赛斯平':
            随访缺失数据字典['环孢素_药品'] = '新赛斯平（杭州中美）'
        calDailyDosage(row[11], '环孢素')

    # 他克莫司
    if row[5] in ['新普乐可复', '普乐可复', '他克莫司胶囊']:
        if row[5] == '新普乐可复':
            随访缺失数据字典['他克莫司_药品'] = '新普乐可复'
        elif row[5] == '普乐可复' or row[5] == '他克莫司胶囊':
            随访缺失数据字典['他克莫司_药品'] = '普乐可复'
        calDailyDosage(row[11], '他克莫司')

    # m-TOR抑制剂
    if row[5] in ['雷帕鸣']:
        if row[5] == '雷帕鸣':
            随访缺失数据字典['mTOR抑制剂_药品'] = '雷帕鸣'
        calDailyDosage(row[11], 'mTOR抑制剂')

    # 激素
    if row[5] in ['欣甲龙', '美卓乐', '甲泼尼龙片', '醋酸泼尼松片', '醋酸地塞米松片']:
        if row[5] == '欣甲龙' or row[5] == '美卓乐' or row[5] == '甲泼尼龙片':
            随访缺失数据字典['激素_药品'] = '甲基强的松龙'
        elif row[5] == '醋酸泼尼松片':
            随访缺失数据字典['激素_药品'] = '泼尼松（强的松）'
        elif row[5] == '醋酸地塞米松片':
            随访缺失数据字典['激素_药品'] = '地塞米松'
        calDailyDosage(row[11], '激素')

print(随访缺失数据字典)

# QD 每天1次
# QM 每天早晨1次
# QN 每天夜间1次

# BID 每天2次
# Q12H 每12小时1次
# BIDAC 每天2次餐前
# BIDCS 每天2次餐时

# TID 每天3次
# TIDCS 每天3餐时
# Q8H 每8小时1次

# QOD 隔天1次
# Q3D 每3天1次
# ONCE 一次
# ST 立即
# QW 每周1次
# BIW2 每周2次(二/五)
# BIW3 每周2次(三/六)


# 抗增殖类
# ['骁悉','塞可平','米芙','布雷迪宁','来氟米特','素能','留䂳嘌呤','美芬可','瑞复舒','瑞易容']

# 环孢素
# ['新山地明（诺华）','新赛斯平（杭州中美）','田可（华北制药）']

# 他克莫司
# ['新普乐可复','赛氏他克莫司','福美欣','普乐可复','川抗']

# m-TOR抑制剂
# ['雷帕鸣','赛莫司','宜欣可','Certican（诺华）','依维莫司（国产）','希罗莫司口服溶液']

# 激素
# ['甲基强的松龙','泼尼松（强的松）','泼尼松龙（强的松龙）','可的松','氢化可的松','地塞米松','去炎松']

# 新赛斯平 Q12H 每12小时1次
# 米芙 QD 每天1次
# 米芙 Q12H 每12小时1次
# 新普乐可复 QD 每天1次
# 新普乐可复 QN 每天夜间1次
# 瑞易容 BID 每天2次
# 骁悉 BID 每天2次
# 新山地明 BID 每天2次
# 普乐可复 BIDCS 每天2次餐时
# 新赛斯平 TIDCS 每天3餐时
# 新山地明 TID 每天3次
# 雷帕鸣 QOD 隔天1次
# 新赛斯平 QM 每天早晨1次
# 骁悉 QOD 隔天1次
# 素能 QD 每天1次
# 素能 TID 每天3次
# 素能 QN 每天夜间1次
# 新山地明 Q12H 每12小时1次
# 骁悉 QD 每天1次
# 雷帕鸣 TID 每天3次
# 雷帕鸣 BIW2 每周2次(二/五)
# 新山地明 QD 每天1次
# 普乐可复 BIDAC 每天2次餐前
# 米芙 BIDAC 每天2次餐前
# 骁悉 ST 立即
# 雷帕鸣 QW 每周1次
# 雷帕鸣 BIW3 每周2次(三/六)
# 新赛斯平 TID 每天3次
# 新赛斯平 BID 每天2次
# 普乐可复 QD 每天1次
# 新赛斯平 QOD 隔天1次
# 普乐可复 Q8H 每8小时1次
# 普乐可复 QM 每天早晨1次
# 素能 BID 每天2次
# 普乐可复 Q12H 每12小时1次
# 雷帕鸣 QD 每天1次
# 新赛斯平 QN 每天夜间1次
# 雷帕鸣 QM 每天早晨1次
# 新普乐可复 QM 每天早晨1次
# 素能 Q12H 每12小时1次
# 普乐可复 BID 每天2次
# 骁悉 Q12H 每12小时1次
# 普乐可复 QN 每天夜间1次
# 新普乐可复 BID 每天2次
# 素能 QM 每天早晨1次
# 米芙 BID 每天2次
# 普乐可复 TID 每天3次
# 骁悉 TID 每天3次
# 雷帕鸣 BID 每天2次
# 新赛斯平 QD 每天1次
# 米芙 TID 每天3次
# 雷帕鸣 Q3D 每3天1次
# 普乐可复 QOD 隔天1次
# 雷帕鸣 ONCE 一次
